app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(params[:school_class])
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Mod 1"], ["room_number", 0], ["created_at", "2018-05-22 20:29:53.064097"], ["updated_at", "2018-05-22 20:29:53.064097"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(params[:school_class])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 12], ["updated_at", "2018-05-22 20:43:12.943180"], ["id", 1]]